backend/app/controllers/auth_controller.rb

  def login
    @user = User.find_by_email(auth_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "user@example.com"], ["LIMIT", 1]]