backend/app/controllers/cards_controller.rb

SELECT "columns".* FROM "columns" WHERE "columns"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "cards" ("column_id", "title", "description", "position", "assignee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["column_id", 3], ["title", "penis"], ["description", nil], ["position", 2], ["assignee_id", 2], ["created_at", "2026-01-16 16:50:51.010199"], ["updated_at", "2026-01-16 16:50:51.010199"]]
---
  def create
    @column = Column.find(params[:column_id])
    @card = @column.cards.build(card_params)
    @card.assignee = current_user if card_params[:assignee_id].blank? # Assign to self default or whatever logic

    if @card.save

UPDATE "cards" SET "position" = ?, "column_id" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["position", 2], ["column_id", 3], ["updated_at", "2026-01-16 16:42:30.551436"], ["id", 1]]
---
  def move
    # Move between columns if column_id is provided and different
    if params[:column_id] && @card.column_id != params[:column_id].to_i
      @card.remove_from_list
      @card.column_id = params[:column_id]
      @card.save!