backend/app/controllers/cards_controller.rb

  def move
    # Move between containers (columns or backlog)
    board = @card.column&.board || @card.backlog&.board
---
SELECT "columns".* FROM "columns" WHERE "columns"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]