backend/app/controllers/columns_controller.rb

  def update
    if @column.update(column_params)
---
UPDATE "columns" SET "position" = ("columns"."position" - 1), "updated_at" = '2026-01-16 16:42:32.613786' WHERE "columns"."board_id" = ? AND "columns"."id" != ? AND ("columns"."position" > 2) AND ("columns"."position" <= 3)  [["board_id", 1], ["id", 2]]

  def set_board
    @board = Board.find(params[:board_id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_column
    @column = @board.columns.find(params[:id])
---
SELECT "columns".* FROM "columns" WHERE "columns"."id" = ? LIMIT ?   [["id", 2], ["LIMIT", 1]]